<a href="https://colab.research.google.com/github/annLiu310/python-basic/blob/master/12_Pandas_Basic_Operations.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Operations

Basic Operation

In [2]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Info on Unique Values and counts

In [4]:
df['col2'].unique()
# return numpy array

array([444, 555, 666])

In [6]:
df['col2'].nunique()
# len(df['col2'].unique())

3

In [7]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecting Data

In [8]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [9]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [0]:
newdf

   col1  col2 col3
3     4   444  xyz

### Applying Functions

apply()

In [0]:
def times2(x):
    return x*2

In [15]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [18]:
# lambda expression
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [17]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [0]:
df['col1'].sum()

10

** Permanently Removing a Column**

In [0]:
del df['col1']
# df.drop('col1', axis=1, inplace = true)

In [21]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Get column and index names: **

In [0]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [0]:
df.index

RangeIndex(start=0, stop=4, step=1)

** Sorting and Ordering a DataFrame:**

In [26]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [27]:
df.sort_values(by='col2') #inplace=False by default

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

** Find Null Values or Check for Null Values**

In [28]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [0]:
# Drop rows with NaN Values
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Filling in NaN values with something else: **

In [0]:
import numpy as np

In [29]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [30]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

In [0]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [32]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [33]:
# similar to excel, A B multi level index
df.pivot_table(values='D',index=['A', 'B'],columns=['C']).fillna('filled')

C             x       y
A   B
bar one       4       1
    two  filled       5
foo one       1       3
    two       2  filled